package com.handge.housingfund.common.service.others.enums;

/**
 * 业务名称
 */
public enum UploadFileBusinessType {

    单位开户("01"),
    单位信息变更("02"),
    单位账户注销("03"),
    单位账号封存("04"),
    单位账号启封("05"),
    清册确认("06"),
    汇缴申请("07"),
    单位补缴("08"),
    单位错缴("09"),
    单位缓缴("10"),
    单位比例调整("11"),
    个人基数调整("12"),
    个人账户设立("13"),
    个人信息变更("14"),
    合并个人账户("15"),
    个人账户封存("16"),
    异地转移接续转出("17"),
    个人账户冻结("18"),
    个人账户启封("19"),
    个人账户解冻("20"),
    异地转移接续转入("21"),

    购买住房("01"),
    建造翻建大修住房("02"),
    离休退休("03"),
    完全丧失劳动能力并与单位终止劳动合同("04"),
    户口迁出所在市县或出境定居("05"),
    偿还购房贷款本息("06"),
    房租超出家庭工资收入的规定比例("07"),
    死亡("08"),
    大病医疗("09"),
    其他("10"),

    房开公司申请("01"),
    楼盘项目申请("02"),
    贷款申请申请人("03"),
    贷款申请共同借款人("04"),
    贷款申请房屋信息购买商品房("05"),
    贷款申请房屋信息购买二手房("06"),
    贷款申请房屋信息自建翻建("07"),
    贷款申请房屋信息大修("08"),
    贷款申请担保信息("09"),
    贷款申请其他资料("10"),
    划拨之前("11"),
    合同变更("12"),
    签订合同("13"),
    房开公司变更("14"),
    楼盘项目变更("15"),

    日常财务处理("01"),
    到账通知单("02");

    private String code;

    UploadFileBusinessType(String code) {
        this.code = code;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }
}
